STMicroelectronics/STM32CubeU5/Utilities/lpbam/STM32U5/stm32_ll_lpbam.c
/**
  **********************************************************************************************************************
  * @file    stm32_ll_lpbam.c
  * @author  MCD Application Team
  * @brief   This file provides the LL LPBAM functions for STM32U5 devices.
  **********************************************************************************************************************
  * @attention
  *
  * Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  **********************************************************************************************************************
  */

/* Includes --------------------------------------------------------------------------------------------------------- */
#include "stm32_ll_lpbam.h"

/** @addtogroup LPBAM_Utilities_Driver
  * @{
  */

/* Private typedef ---------------------------------------------------------------------------------------------------*/
/* Private define ----------------------------------------------------------------------------------------------------*/
/* Private macro -----------------------------------------------------------------------------------------------------*/
/* Private function prototypes ---------------------------------------------------------------------------------------*/
/** @addtogroup LPBAM_LL_Private_Functions
  * @{
  */

#if defined (LPBAM_ADC_MODULE_ENABLED)
/**
  * @brief  Fill the structure information for ADC peripheral nodes.
  * @param  pConfNode    : [IN]  Pointer to a LPBAM_ADC_ConfNode_t structure that contains node configuration.
  * @param  pDescInfo    : [OUT] Pointer to a LPBAM_InfoDesc_t structure that contains descriptor information.
  * @retval LPBAM Status : [OUT] Value from LPBAM_Status_t enumeration.
  */
LPBAM_Status_t LPBAM_ADC_FillStructInfo(LPBAM_ADC_ConfNode_t const *const pConfNode,
                                        LPBAM_InfoDesc_t     *const pDescInfo)
{
  /* LPBAM Configuration ADC Descriptor Items Table */
  static const LPBAM_ItemDesc_t LPBAM_ADC_DescItem_Tbl[] =
  {
    /* LPBAM ADC State ID                 */
    {LPBAM_ADC_STATE_OFFSET,             LPBAM_ADC_STATE_DATASIZE            },
    /* LPBAM ADC Configuration ID         */
    {LPBAM_ADC_CONFIG_OFFSET,            LPBAM_ADC_CONFIG_DATASIZE           },
    /* LPBAM ADC Channel Selection ID     */
    {LPBAM_ADC_CHANNELSELECTION_OFFSET,  LPBAM_ADC_CHANNELSELECTION_DATASIZE },
    /* LPBAM ADC AWDG Threshold ID        */
    {LPBAM_ADC_AWDG_THESHOLD_OFFSET,     LPBAM_ADC_AWDG_THESHOLD_DATASIZE    },
    /* LPBAM ADC AWDG Monitor ID          */
    {LPBAM_ADC_AWDG_MONITOR_OFFSET,      LPBAM_ADC_AWDG_MONITOR_DATASIZE     },
    /* LPBAM ADC Trigger Low Frequency ID */
    {LPBAM_ADC_TRIG_LOWFREQUENCY_OFFSET, LPBAM_ADC_TRIG_LOWFREQUENCY_DATASIZE},
    /* LPBAM ADC Prescaler ID             */
    {LPBAM_ADC_CLKPRESCALER_OFFSET,      LPBAM_ADC_CLKPRESCALER_DATASIZE     },
    /* LPBAM ADC Interrupt Clear Flag ID  */
    {LPBAM_ADC_CLEARFLAG_OFFSET,         LPBAM_ADC_CLEARFLAG_DATASIZE        },
    /* LPBAM ADC Wakeup Interrupt ID      */
    {LPBAM_ADC_WAKEUP_IT_OFFSET,         LPBAM_ADC_WAKEUP_IT_DATASIZE        },
    /* LPBAM ADC Data transfer ID         */
    {LPBAM_ADC_DATA_OFFSET,              0U                                  },
  };

  uint32_t dummy = 0U;

  /* Check node ID */
  switch (pConfNode->NodeDesc.NodeInfo.NodeID)
  {
    /* LPBAM ADC State ID */
    case LPBAM_ADC_STATE_ID:
    {
      /* Get control register value */
      dummy = pConfNode->pInstance->CR & ~(LPBAM_ADC_ADSTP | LPBAM_ADC_ADSTART);

      /* Check ADC start state */
      if ((pConfNode->Config.State) == ENABLE)
      {
        dummy |= LPBAM_ADC_ADSTART;
      }
      /* Check ADC stop state */
      else if ((pConfNode->Config.State) == DISABLE)
      {
        dummy |= LPBAM_ADC_ADSTP;
      }
      else
      {
        /* Return LPBAM status */
        return LPBAM_ERROR;
      }

      /* Set value to be written */
      *pConfNode->NodeDesc.pSrcVarReg = dummy;

      /* Set DMA source address */
      pDescInfo->SrcAddr  = (uint32_t)pConfNode->NodeDesc.pSrcVarReg;
      /* Set DMA destination address */
      pDescInfo->DstAddr  = LPBAM_ADC_DescItem_Tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegOffset +
                            (uint32_t)pConfNode->pInstance;
      /* Set DMA data size */
      pDescInfo->DataSize = LPBAM_ADC_DescItem_Tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegDataSize;

      break;
    }

    /* LPBAM ADC Configuration ID */
    case LPBAM_ADC_CONFIG_ID:
    {
      /* Set threshold analog watchdog 1 */
      if (pConfNode->Config.UpdateAnalogWDG == LPBAM_ADC_ANALOGWATCHDOG_DEFAULT)
      {
        /* Get CFGR register value */
        dummy = pConfNode->pInstance->CFGR1;

        /* Set ADC trigger configuration */
        MODIFY_REG(dummy, (LPBAM_ADC_EXTSEL | LPBAM_ADC_EXTEN),
                   ((pConfNode->Config.ExternalTrigConv << LPBAM_ADC_EXTSEL_POS) |
                    (pConfNode->Config.ExternalTrigConvEdge << LPBAM_ADC_EXTEN_POS)));

        /* Set ADC conversion mode */
        if (pConfNode->Config.ContinuousConvMode == ENABLE)
        {
          dummy |= LPBAM_ADC_CONT;
          dummy &= ~LPBAM_ADC_DISCEN;
        }
        else
        {
          dummy &= ~LPBAM_ADC_CONT;
          dummy |= LPBAM_ADC_DISCEN;

          /* Check ADC discontinuous mode */
          if (pConfNode->Config.DiscontinuousConvMode == ENABLE)
          {
            dummy &= ~LPBAM_ADC_CONT;
            dummy |= LPBAM_ADC_DISCEN;
          }
          else
          {
            dummy &= ~LPBAM_ADC_CONT;
            dummy &= ~LPBAM_ADC_DISCEN;
          }
        }

        /* Set ADC channel backward scan direction */
        if (pConfNode->Config.ScanConvMode == LPBAM_ADC_SCAN_DIRECTION_BACKWARD)
        {
          dummy |= LPBAM_ADC_SCANDIR;
          dummy &= ~LPBAM_ADC_CHSELRMOD;
        }
        /* Set ADC channel forward scan direction */
        else if (pConfNode->Config.ScanConvMode == LPBAM_ADC_SCAN_DIRECTION_FORWARD)
        {
          dummy &= ~LPBAM_ADC_SCANDIR;
          dummy &= ~LPBAM_ADC_CHSELRMOD;
        }
        /* Set ADC channel scan enable */
        else if (pConfNode->Config.ScanConvMode == LPBAM_ADC_SCAN_ENABLE)
        {
          dummy |= LPBAM_ADC_CHSELRMOD;
        }
        /* Set ADC channel scan disable */
        else
        {
          dummy &= ~LPBAM_ADC_CHSELRMOD;
        }

        /* Set ADC wait conversion state */
        if (pConfNode->Config.LowPowerAutoWait == ENABLE)
        {
          /* Set wait conversion */
          dummy |= LPBAM_ADC_WAIT;
        }
        else
        {
          /* Clear wait conversion */
          dummy &= ~LPBAM_ADC_WAIT;
        }

        /* Enable DMA for ADC peripheral */
        if (pConfNode->Config.DMAContinuousRequests == ENABLE)
        {
          /* Circular DMA mode */
          dummy |= LPBAM_ADC_DMACFG;
        }
        else
        {
          /* One shot DMA mode */
          dummy &= ~LPBAM_ADC_DMACFG;
        }
      }

      /* Check analog watchdog index */
      if (pConfNode->Config.AnalogWDGConfig[0U].WatchdogMode != LPBAM_ADC_ANALOGWATCHDOG_NONE)
      {
        /* Enable analog watchdog 1 */
        dummy |= LPBAM_ADC_AWD1EN;

        if (pConfNode->Config.AnalogWDGConfig[0U].WatchdogMode == LPBAM_ADC_ANALOGWATCHDOG_SINGLE_REG)
        {
          dummy |= LPBAM_ADC_AWD1SGL;
          dummy |= (POSITION_VAL(pConfNode->Config.AnalogWDGConfig[0U].Channel &
                                 (~CHANNEL_ID_INTERNAL_CH)) << LPBAM_ADC_AWD1CH_POS);
        }
        else
        {
          dummy &= ~LPBAM_ADC_AWD1SGL;
        }
      }
      else
      {
        /* Disable analog watchdog 1 */
        dummy &= ~LPBAM_ADC_AWD1EN;
      }

      /* Set value to be written */
      *pConfNode->NodeDesc.pSrcVarReg = dummy;

      /* Set DMA source address */
      pDescInfo->SrcAddr  = (uint32_t)pConfNode->NodeDesc.pSrcVarReg;
      /* Set DMA destination address */
      pDescInfo->DstAddr  = LPBAM_ADC_DescItem_Tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegOffset +
                            (uint32_t)pConfNode->pInstance;
      /* Set DMA data size */
      pDescInfo->DataSize = LPBAM_ADC_DescItem_Tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegDataSize;

      break;
    }

    /* LPBAM ADC Channel Selection ID */
    case LPBAM_ADC_CHANNELSELECTION_ID:
    {
      /* Set DMA source address */
      pDescInfo->SrcAddr  = (uint32_t)pConfNode->NodeDesc.pSrcVarReg;
      /* Set DMA destination address */
      pDescInfo->DstAddr  = LPBAM_ADC_DescItem_Tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegOffset +
                            (uint32_t)pConfNode->pInstance;
      /* Set DMA data size */
      pDescInfo->DataSize = LPBAM_ADC_DescItem_Tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegDataSize;

      break;
    }

    /* LPBAM ADC trigger low frequency ID */
    case LPBAM_ADC_TRIG_LOWFREQUENCY_ID:
    {
      /* Get CFGR register value */
      dummy = pConfNode->pInstance->CFGR2;

      /* Configure ADC Low Frequency Trig */
      MODIFY_REG(dummy, LPBAM_ADC_LFTRIG, (pConfNode->Config.TriggerFrequencyMode << LPBAM_ADC_LFTRIG_POS));

      /* Set value to be written */
      *pConfNode->NodeDesc.pSrcVarReg = dummy;

      /* Set DMA source address */
      pDescInfo->SrcAddr  = (uint32_t)pConfNode->NodeDesc.pSrcVarReg;
      /* Set DMA destination address */
      pDescInfo->DstAddr  = LPBAM_ADC_DescItem_Tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegOffset +
                            (uint32_t)pConfNode->pInstance;
      /* Set DMA data size */
      pDescInfo->DataSize = LPBAM_ADC_DescItem_Tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegDataSize;

      break;
    }

