STMicroelectronics/STM32CubeU5/Utilities/lpbam/STM32U5/stm32_ll_lpbam.c
    /* LPBAM ADC AWDG threshold ID */
    case LPBAM_ADC_AWDG_THRESHOLD_ID:
    {
      /* Set threshold analog watchdog 1 */
      if (pConfNode->Config.UpdateAnalogWDG == LPBAM_ADC_ANALOGWATCHDOG_1)
      {
        /* Check analog watchdog mode */
        if (pConfNode->Config.AnalogWDGConfig[0U].WatchdogMode != LPBAM_ADC_ANALOGWATCHDOG_NONE)
        {
          /* Set analog watchdog threshold new values */
          dummy = ((pConfNode->Config.AnalogWDGConfig[0U].HighThreshold  << LPBAM_ADC_HT1_POS) |
                   (pConfNode->Config.AnalogWDGConfig[0U].LowThreshold));
        }
        else
        {
          /* Set analog watchdog threshold default values */
          dummy = LPBAM_ADC_AWD_DEFAULT_VALUE;
        }

        /* Set DMA destination address */
        pDescInfo->DstAddr = LPBAM_ADC_DescItem_Tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegOffset +
                             (uint32_t)pConfNode->pInstance + LPBAM_ADC_AWDG1_THRESHOLD_OFFSET;
      }

      /* Set threshold analog watchdog 2 */
      if (pConfNode->Config.UpdateAnalogWDG == LPBAM_ADC_ANALOGWATCHDOG_2)
      {
        /* Check analog watchdog mode */
        if (pConfNode->Config.AnalogWDGConfig[1U].WatchdogMode != LPBAM_ADC_ANALOGWATCHDOG_NONE)
        {
          /* Set analog watchdog threshold new values */
          dummy = ((pConfNode->Config.AnalogWDGConfig[1U].HighThreshold  << LPBAM_ADC_HT1_POS) |
                   (pConfNode->Config.AnalogWDGConfig[1U].LowThreshold));
        }
        else
        {
          /* Set analog watchdog threshold default values */
          dummy = LPBAM_ADC_AWD_DEFAULT_VALUE;
        }

        /* Set DMA destination address */
        pDescInfo->DstAddr = LPBAM_ADC_DescItem_Tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegOffset +
                             (uint32_t)pConfNode->pInstance + LPBAM_ADC_AWDG2_THRESHOLD_OFFSET;
      }

      /* Set threshold analog watchdog 3 */
      if (pConfNode->Config.UpdateAnalogWDG == LPBAM_ADC_ANALOGWATCHDOG_3)
      {
        /* Check analog watchdog mode */
        if (pConfNode->Config.AnalogWDGConfig[2U].WatchdogMode != LPBAM_ADC_ANALOGWATCHDOG_NONE)
        {
          /* Set analog watchdog threshold new values */
          dummy = ((pConfNode->Config.AnalogWDGConfig[2U].HighThreshold  << LPBAM_ADC_HT1_POS) |
                   (pConfNode->Config.AnalogWDGConfig[2U].LowThreshold));
        }
        else
        {
          /* Set analog watchdog threshold default values */
          dummy = LPBAM_ADC_AWD_DEFAULT_VALUE;
        }

        /* Set DMA destination address */
        pDescInfo->DstAddr = LPBAM_ADC_DescItem_Tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegOffset +
                             (uint32_t)pConfNode->pInstance + LPBAM_ADC_AWDG3_THRESHOLD_OFFSET;
      }

      /* Set value to be written */
      *pConfNode->NodeDesc.pSrcVarReg = dummy;

      /* Set DMA source address */
      pDescInfo->SrcAddr  = (uint32_t)pConfNode->NodeDesc.pSrcVarReg;
      /* Set DMA data size */
      pDescInfo->DataSize = LPBAM_ADC_DescItem_Tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegDataSize;

      break;
    }

    /* LPBAM ADC analog watchdog monitor ID */
    case LPBAM_ADC_AWDG_MONITOR_ID:
    {
      /* Set monitor analog watchdog 2 */
      if (pConfNode->Config.UpdateAnalogWDG == LPBAM_ADC_ANALOGWATCHDOG_2)
      {
        /* Check analog watchdog mode */
        if (pConfNode->Config.AnalogWDGConfig[1U].WatchdogMode != LPBAM_ADC_ANALOGWATCHDOG_NONE)
        {
          if (pConfNode->Config.AnalogWDGConfig[1U].WatchdogMode == LPBAM_ADC_ANALOGWATCHDOG_SINGLE_REG)
          {
            dummy = pConfNode->Config.AnalogWDGConfig[1U].Channel;
          }
          else
          {
            dummy = LPBAM_ADC_ANALOGWATCHDOG_ALL_CH;
          }
        }

        /* Set DMA destination address */
        pDescInfo->DstAddr = LPBAM_ADC_DescItem_Tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegOffset +
                             (uint32_t)pConfNode->pInstance + LPBAM_ADC_AWDG2_MONITOR_OFFSET;
      }

      /* Set monitor analog watchdog 3 */
      if (pConfNode->Config.UpdateAnalogWDG == LPBAM_ADC_ANALOGWATCHDOG_3)
      {
        /* Check analog watchdog mode */
        if (pConfNode->Config.AnalogWDGConfig[2U].WatchdogMode != LPBAM_ADC_ANALOGWATCHDOG_NONE)
        {
          if (pConfNode->Config.AnalogWDGConfig[2U].WatchdogMode == LPBAM_ADC_ANALOGWATCHDOG_SINGLE_REG)
          {
            dummy = pConfNode->Config.AnalogWDGConfig[2U].Channel;
          }
          else
          {
            dummy = LPBAM_ADC_ANALOGWATCHDOG_ALL_CH;
          }
        }

        /* Set DMA destination address */
        pDescInfo->DstAddr = LPBAM_ADC_DescItem_Tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegOffset +
                             (uint32_t)pConfNode->pInstance + LPBAM_ADC_AWDG3_MONITOR_OFFSET;
      }

      /* Set value to be written */
      *pConfNode->NodeDesc.pSrcVarReg = dummy;

      /* Set DMA source address */
      pDescInfo->SrcAddr  = (uint32_t)pConfNode->NodeDesc.pSrcVarReg;
      /* Set DMA data size */
      pDescInfo->DataSize = LPBAM_ADC_DescItem_Tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegDataSize;

      break;
    }

    /* LPBAM ADC Prescaler ID */
    case LPBAM_ADC_CLKPRESCALER_ID:
    {
      /* Get CCR register value */
      dummy = *(uint32_t *)((uint32_t)pConfNode->pInstance + LPBAM_ADC_CLKPRESCALER_OFFSET);

      /* Set value to be written */
      *pConfNode->NodeDesc.pSrcVarReg = dummy;

      /* Set DMA source address */
      pDescInfo->SrcAddr  = (uint32_t)pConfNode->NodeDesc.pSrcVarReg;
      /* Set DMA destination address */
      pDescInfo->DstAddr  = LPBAM_ADC_DescItem_Tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegOffset +
                            (uint32_t)pConfNode->pInstance;
      /* Set DMA data size */
      pDescInfo->DataSize = LPBAM_ADC_DescItem_Tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegDataSize;

      break;
    }

    /* LPBAM ADC Interrupt Clear Flag ID */
    case LPBAM_ADC_CLEARFLAG_ID:
    {
      /* Get ISR register value */
      dummy = LPBAM_ADC_IT_AWD1 | LPBAM_ADC_IT_AWD2 | LPBAM_ADC_IT_AWD3;

      /* Set value to be written */
      *pConfNode->NodeDesc.pSrcVarReg = dummy;

      /* Set DMA source address */
      pDescInfo->SrcAddr  = (uint32_t)pConfNode->NodeDesc.pSrcVarReg;
      /* Set DMA destination address */
      pDescInfo->DstAddr  = LPBAM_ADC_DescItem_Tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegOffset +
                            (uint32_t)pConfNode->pInstance;
      /* Set DMA data size */
      pDescInfo->DataSize = LPBAM_ADC_DescItem_Tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegDataSize;

      break;
    }

    /* LPBAM ADC Wakeup Interrupt ID */
    case LPBAM_ADC_WAKEUP_IT_ID:
    {
      /* Get IER register value */
      dummy = pConfNode->pInstance->IER;

