STMicroelectronics/STM32CubeU5/Utilities/lpbam/STM32U5/stm32_ll_lpbam.c
      /* Configure ADC AWDG1 interrupt */
      if (pConfNode->Config.AnalogWDGConfig[0U].ITMode == ENABLE)
      {
        /* Set ADC AWDG1 interrupt */
        SET_BIT(dummy, LPBAM_ADC_IT_AWD1);
      }
      else
      {
        /* Clear ADC AWDG1 interrupt */
        CLEAR_BIT(dummy, LPBAM_ADC_IT_AWD1);
      }

      /* Configure ADC AWDG2 interrupt */
      if (pConfNode->Config.AnalogWDGConfig[1U].ITMode == ENABLE)
      {
        /* Set ADC AWDG2 interrupt */
        SET_BIT(dummy, LPBAM_ADC_IT_AWD2);
      }
      else
      {
        /* Clear ADC AWDG2 interrupt */
        CLEAR_BIT(dummy, LPBAM_ADC_IT_AWD2);
      }

      /* Configure ADC AWDG3 interrupt */
      if (pConfNode->Config.AnalogWDGConfig[2U].ITMode == ENABLE)
      {
        /* Set ADC AWDG3 interrupt */
        SET_BIT(dummy, LPBAM_ADC_IT_AWD3);
      }
      else
      {
        /* Clear ADC AWDG3 interrupt */
        CLEAR_BIT(dummy, LPBAM_ADC_IT_AWD3);
      }

      /* Set value to be written */
      *pConfNode->NodeDesc.pSrcVarReg = dummy;

      /* Set DMA source address */
      pDescInfo->SrcAddr  = (uint32_t)pConfNode->NodeDesc.pSrcVarReg;
      /* Set DMA destination address */
      pDescInfo->DstAddr  = LPBAM_ADC_DescItem_Tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegOffset +
                            (uint32_t)pConfNode->pInstance;
      /* Set DMA data size */
      pDescInfo->DataSize = LPBAM_ADC_DescItem_Tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegDataSize;

      break;
    }

    /* LPBAM ADC Data transfer ID */
    case LPBAM_ADC_DATA_ID:
    {
      /* Set DMA request */
      pDescInfo->Request  = LPDMA1_REQUEST_ADC4;

      /* Set DMA source address */
      pDescInfo->SrcAddr  = LPBAM_ADC_DescItem_Tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegOffset +
                            (uint32_t)pConfNode->pInstance;
      /* Set DMA destination address */
      pDescInfo->DstAddr  = (uint32_t)pConfNode->NodeDesc.pBuff;
      /* Set DMA data size */
      pDescInfo->DataSize = (uint16_t)(pConfNode->Config.Size * 2U);

      break;
    }

    default:
    {
      /* return status */
      return LPBAM_INVALID_ID;
      break;
    }
  }

  return LPBAM_OK;
}
#endif /* defined (LPBAM_ADC_MODULE_ENABLED) */


#if defined (LPBAM_COMP_MODULE_ENABLED)
/**
  * @brief  Fill the structure information for COMP peripheral nodes.
  * @param  pConfNode    : [IN]  Pointer to a LPBAM_COMP_ConfNode_t structure that contains node configuration.
  * @param  pDescInfo    : [OUT] Pointer to a LPBAM_InfoDesc_t structure that contains descriptor information.
  * @retval LPBAM Status : [OUT] Value from LPBAM_Status_t enumeration.
  */
LPBAM_Status_t LPBAM_COMP_FillStructInfo(LPBAM_COMP_ConfNode_t const *const pConfNode,
                                         LPBAM_InfoDesc_t      *const pDescInfo)
{
  /* LPBAM Configuration COMP Descriptor Items Table */
  static const LPBAM_ItemDesc_t LPBAM_COMP_DescItem_Tbl[] =
  {
    /* LPBAM COMP configuration node ID     */
    {LPBAM_COMP_CONFIG_OFFSET,     LPBAM_COMP_CONFIG_DATASIZE},
    /* LPBAM COMP read output value node ID */
    {LPBAM_COMP_READOUTPUT_OFFSET, 0U                        },
  };

  uint32_t dummy;

  /* Check node ID */
  switch (pConfNode->NodeDesc.NodeInfo.NodeID)
  {
    /* LPBAM COMP configuration node ID */
    case LPBAM_COMP_CONFIG_ID:
    {
      /* Get register value */
      dummy = (((uint32_t)pConfNode->Instance->CSR & LPBAM_COMP_CONFIG_MASK) | (uint32_t)pConfNode->Config.State |
               pConfNode->Config.OutputPol | pConfNode->Config.InputPlus | pConfNode->Config.InputMinus);

      /* Set value to be written */
      *pConfNode->NodeDesc.pSrcVarReg = dummy;

      /* Set DMA source address */
      pDescInfo->SrcAddr  = (uint32_t)pConfNode->NodeDesc.pSrcVarReg;
      /* Set DMA destination address */
      pDescInfo->DstAddr  = LPBAM_COMP_DescItem_Tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegOffset +
                            (uint32_t)pConfNode->Instance;
      /* Set DMA data size */
      pDescInfo->DataSize = LPBAM_COMP_DescItem_Tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegDataSize;

      break;
    }

    /* LPBAM COMP read output value node ID */
    case LPBAM_COMP_READOUTPUT_ID:
    {
      /* Set DMA source address */
      pDescInfo->SrcAddr  = LPBAM_COMP_DescItem_Tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegOffset +
                            (uint32_t)pConfNode->Instance;
      /* Set DMA destination address */
      pDescInfo->DstAddr  = (uint32_t)pConfNode->NodeDesc.pBuff;
      /* Set DMA data size */
      pDescInfo->DataSize = (uint32_t)pConfNode->Config.Size * 4U;

      break;
    }

    default:
    {
      /* return status */
      return LPBAM_INVALID_ID;
      break;
    }
  }

  return LPBAM_OK;
}
#endif /* LPBAM_COMP_MODULE_ENABLED */


#if defined(LPBAM_DAC_MODULE_ENABLED)
/**
  * @brief  Fill the structure information for DAC peripheral nodes.
  * @param  pConfNode    : [IN]  Pointer to a LPBAM_DAC_ConfNode_t structure that contains node configuration.
  * @param  pDescInfo    : [OUT] Pointer to a LPBAM_InfoDesc_t structure that contains descriptor information.
  * @retval LPBAM Status : [OUT] Value from LPBAM_Status_t enumeration.
  */
LPBAM_Status_t LPBAM_DAC_FillStructInfo(LPBAM_DAC_ConfNode_t const *const pConfNode,
                                        LPBAM_InfoDesc_t     *const pDescInfo)
{
  /* LPBAM Configuration DAC Descriptor Items Table */
  static const LPBAM_ItemDesc_t LPBAM_DAC_DescItem_Tbl[] =
  {
    /* LPBAM DAC configuration node ID */
    {LPBAM_DAC_CONFIG_OFFSET, LPBAM_DAC_CONFIG_DATASIZE},
    /* LPBAM DAC data node ID          */
    {LPBAM_DAC_DATA_OFFSET,   0U                       },
  };

  uint32_t dummy;

  /* Check node ID */
  switch (pConfNode->NodeDesc.NodeInfo.NodeID)
  {
    /* LPBAM DAC configuration node ID */
    case LPBAM_DAC_CONFIG_ID:
    {
      /* Get CR value */
      dummy = pConfNode->pInstance->CR;

      /* Check DAC channel1 */
      if ((pConfNode->Config[0U].Channel & LPBAM_DAC_CHANNEL_1) == LPBAM_DAC_CHANNEL_1)
      {
        /* Set DAC state */
        if (pConfNode->Config[0U].State == ENABLE)
        {
          dummy |= DAC_CR_EN1;

