STMicroelectronics/STM32CubeU5/Utilities/lpbam/STM32U5/stm32_ll_lpbam.c
          /* Set DAC trigger */
          dummy &= ~DAC_CR_TSEL1;
          dummy |= DAC_CR_TEN1 | (pConfNode->Config[0U].DAC_Trigger << DAC_CR_TSEL1_Pos);
        }
        else
        {
          dummy &= ~DAC_CR_EN1;
        }
      }

      /* Check DAC channel 1 */
      if ((pConfNode->Config[0U].Channel & LPBAM_DAC_CHANNEL_2) == LPBAM_DAC_CHANNEL_2)
      {
        /* Set DAC state */
        if (pConfNode->Config[0U].State == ENABLE)
        {
          dummy |= DAC_CR_EN2;

          /* Set trigger */
          dummy &= ~DAC_CR_TSEL2;
          dummy |= DAC_CR_TEN2 | (pConfNode->Config[0U].DAC_Trigger << DAC_CR_TSEL2_Pos);
        }
        else
        {
          dummy &= ~DAC_CR_EN2;
        }
      }

      /* Check DAC channel 2 */
      if ((pConfNode->Config[1U].Channel & LPBAM_DAC_CHANNEL_2) == LPBAM_DAC_CHANNEL_2)
      {
        /* Set DAC state */
        if (pConfNode->Config[1U].State == ENABLE)
        {
          dummy |= DAC_CR_EN2;

          /* Set trigger */
          dummy &= ~DAC_CR_TSEL2;
          dummy |= DAC_CR_TEN2 | (pConfNode->Config[1U].DAC_Trigger << DAC_CR_TSEL2_Pos);
        }
        else
        {
          dummy &= ~DAC_CR_EN2;
        }
      }

      /* Set value to be written */
      *pConfNode->NodeDesc.pSrcVarReg = dummy;

      /* Set DMA source address */
      pDescInfo->SrcAddr  = (uint32_t)pConfNode->NodeDesc.pSrcVarReg;
      /* Set DMA destination address */
      pDescInfo->DstAddr  = LPBAM_DAC_DescItem_Tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegOffset +
                            (uint32_t)pConfNode->pInstance;
      /* Set DMA data size */
      pDescInfo->DataSize = LPBAM_DAC_DescItem_Tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegDataSize;

      break;
    }

    /* LPBAM DAC data node ID */
    case LPBAM_DAC_DATA_ID:
    {
      /* Set DMA source address */
      pDescInfo->SrcAddr  = (uint32_t)pConfNode->NodeDesc.pBuff;
      /* Set DMA destination address */
      pDescInfo->DstAddr = LPBAM_DAC_DescItem_Tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegOffset +
                           (uint32_t)pConfNode->pInstance;

      /* Check DAC channel */
      if (pConfNode->Config->Channel == LPBAM_DAC_CHANNEL_1)
      {
        /* Set DMA request */
        pDescInfo->Request = LPDMA1_REQUEST_DAC1_CH1;
      }
      else if (pConfNode->Config->Channel == LPBAM_DAC_CHANNEL_2)
      {
        /* Set DMA request */
        pDescInfo->Request = LPDMA1_REQUEST_DAC1_CH2;
        /* Set channel offset */
        pDescInfo->DstAddr += LPBAM_DAC_CHANNEL_OFFSET;
      }
      else
      {
        /* Return LPBAM status */
        return LPBAM_ERROR;
      }

      /* Check data alignment */
      if (pConfNode->Config->Alignment == LPBAM_DAC_ALIGN_12B_L)
      {
        /* Update destination address */
        pDescInfo->DstAddr += LPBAM_DAC_ALIGN_12B_L;
      }
      else if (pConfNode->Config->Alignment == LPBAM_DAC_ALIGN_8B_R)
      {
        /* Update destination address */
        pDescInfo->DstAddr += LPBAM_DAC_ALIGN_8B_R;
      }
      else
      {
        /* Nothing to do */
      }

      /* Set DMA data size */
      pDescInfo->DataSize = (uint32_t)pConfNode->Config->Size * 4U;

      break;
    }

    default:
    {
      /* return status */
      return LPBAM_INVALID_ID;
      break;
    }
  }

  return LPBAM_OK;
}
#endif /* LPBAM_DAC_MODULE_ENABLED */


#if defined (LPBAM_DMA_MODULE_ENABLED)
/**
  * @brief  Fill the structure information for DMA peripheral nodes.
  * @param  pConfNode    : [IN]  Pointer to a LPBAM_DMA_ConfNode_t structure that contains node configuration.
  * @param  pDescInfo    : [OUT] Pointer to a LPBAM_InfoDesc_t structure that contains descriptor information.
  * @retval LPBAM Status : [OUT] Value from LPBAM_Status_t enumeration.
  */
LPBAM_Status_t LPBAM_DMA_FillStructInfo(LPBAM_DMA_ConfNode_t const *const pConfNode,
                                        LPBAM_InfoDesc_t     *const pDescInfo)
{
  /* LPBAM Configuration DMA Descriptor Items Table */
  static const LPBAM_ItemDesc_t dma_descitem_tbl[] =
  {
    /* LPBAM DMA configuration node ID  */
    {LPBAM_DMA_CONFIG_OFFSET,              LPBAM_DMA_CONFIG_DATASIZE             },
    /* LPBAM DMA base address node ID   */
    {LPBAM_DMA_QUEUE_BASEADDRESS_OFFSET,   LPBAM_DMA_QUEUE_BASEADDRESS_DATASIZE  },
    /* LPBAM DMA offset address node ID */
    {LPBAM_DMA_QUEUE_OFFSETADDRESS_OFFSET, LPBAM_DMA_QUEUE_OFFSETADDRESS_DATASIZE},
    /* LPBAM DMA clear data size node ID */
    {LPBAM_DMA_CLEARDATASIZE_OFFSET,       LPBAM_DMA_CLEARDATASIZE_DATASIZE      },
    /* LPBAM DMA clear flag node ID     */
    {LPBAM_DMA_CLEARFLAG_OFFSET,           LPBAM_DMA_CLEARFLAG_DATASIZE          }
  };

  uint32_t dummy;

  /* Check node ID */
  switch (pConfNode->NodeDesc.NodeInfo.NodeID)
  {
    /* LPBAM DMA configuration node ID */
    case LPBAM_DMA_CONFIG_ID:
    {
      /* Get control register value */
      dummy = pConfNode->pInstance->CCR;

      /* Check DMA state */
      if (pConfNode->Config.State == ENABLE)
      {
        /* Set DMA state */
        dummy |= DMA_CCR_EN;

        /* Configure interrupts */
        MODIFY_REG(dummy, (DMA_CCR_TCIE | DMA_CCR_HTIE), (pConfNode->Config.WakeupIT << DMA_CCR_TCIE_Pos));
      }
      else
      {
        /* Set DMA state */
        dummy |= DMA_CCR_RESET | DMA_CCR_SUSP;
      }

      /* Set value to be written */
      *pConfNode->NodeDesc.pSrcVarReg = dummy;

      /* Set DMA source address */
      pDescInfo->SrcAddr  = (uint32_t)pConfNode->NodeDesc.pSrcVarReg;
      /* Set DMA destination address */
      pDescInfo->DstAddr  = dma_descitem_tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegOffset +
                            (uint32_t)pConfNode->pInstance;
      /* Set DMA data size */
      pDescInfo->DataSize = dma_descitem_tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegDataSize;

      break;
    }

    /* LPBAM DMA base address node ID */
    case LPBAM_DMA_QUEUE_BASEADDRESS_ID:
    {
      /* Set value to be written */
      dummy = (pConfNode->Config.HeadQAddress & DMA_CLBAR_LBA);

      /* Set value to be written */
      *pConfNode->NodeDesc.pSrcVarReg = dummy;

      /* Set DMA source address */
      pDescInfo->SrcAddr  = (uint32_t)pConfNode->NodeDesc.pSrcVarReg;
      /* Set DMA destination address */
      pDescInfo->DstAddr  = dma_descitem_tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegOffset +
                            (uint32_t)pConfNode->pInstance;
      /* Set DMA data size */
      pDescInfo->DataSize = dma_descitem_tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegDataSize;

      break;
    }

    /* LPBAM DMA offset address node ID */
    case LPBAM_DMA_QUEUE_OFFSETADDRESS_ID:
    {
      /* Calculate CLLR value */
      dummy = (pConfNode->Config.HeadQAddress & DMA_CLLR_LA);
      dummy |= DMA_CLLR_UT1 | DMA_CLLR_UT2 | DMA_CLLR_UB1 | DMA_CLLR_USA | DMA_CLLR_UDA | DMA_CLLR_ULL;

      /* Set value to be written */
      *pConfNode->NodeDesc.pSrcVarReg = dummy;

      /* Set DMA source address */
      pDescInfo->SrcAddr  = (uint32_t)pConfNode->NodeDesc.pSrcVarReg;
      /* Set DMA destination address */
      pDescInfo->DstAddr  = dma_descitem_tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegOffset +
                            (uint32_t)pConfNode->pInstance;
      /* Set DMA data size */
      pDescInfo->DataSize = dma_descitem_tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegDataSize;

      break;
    }

    /* LPBAM DMA clear data size node ID */
    case LPBAM_DMA_CLEARDATASIZE_ID:
    {
      /* Calculate clear flag mask */
      dummy = 0U;

      /* Set value to be written */
      *pConfNode->NodeDesc.pSrcVarReg = dummy;

      /* Set DMA source address */
      pDescInfo->SrcAddr  = (uint32_t)pConfNode->NodeDesc.pSrcVarReg;
      /* Set DMA destination address */
      pDescInfo->DstAddr  = dma_descitem_tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegOffset +
                            (uint32_t)pConfNode->pInstance;
      /* Set DMA data size */
      pDescInfo->DataSize = dma_descitem_tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegDataSize;

      break;
    }

