STMicroelectronics/STM32CubeU5/Utilities/lpbam/STM32U5/stm32_ll_lpbam.c
    /* LPBAM DMA clear flag node ID */
    case LPBAM_DMA_CLEARFLAG_ID:
    {
      /* Calculate clear flag mask */
      dummy = DMA_CFCR_TCF | DMA_CFCR_HTF | DMA_CFCR_TOF;

      /* Set value to be written */
      *pConfNode->NodeDesc.pSrcVarReg = dummy;

      /* Set DMA source address */
      pDescInfo->SrcAddr  = (uint32_t)pConfNode->NodeDesc.pSrcVarReg;
      /* Set DMA destination address */
      pDescInfo->DstAddr  = dma_descitem_tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegOffset +
                            (uint32_t)pConfNode->pInstance;
      /* Set DMA data size */
      pDescInfo->DataSize = dma_descitem_tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegDataSize;

      break;
    }

    default:
    {
      /* return status */
      return LPBAM_INVALID_ID;
      break;
    }
  }

  return LPBAM_OK;
}
#endif /* defined (LPBAM_DMA_MODULE_ENABLED) */


#if defined (LPBAM_GPIO_MODULE_ENABLED)
/**
  * @brief  Fill the structure information for GPIO peripheral nodes.
  * @param  pConfNode    : [IN]  Pointer to a LPBAM_GPIO_ConfNode_t structure that contains node configuration.
  * @param  pDescInfo    : [OUT] Pointer to a LPBAM_InfoDesc_t structure that contains descriptor information.
  * @retval LPBAM Status : [OUT] Value from LPBAM_Status_t enumeration.
  */
LPBAM_Status_t LPBAM_GPIO_FillStructInfo(LPBAM_GPIO_ConfNode_t const *const pConfNode,
                                         LPBAM_InfoDesc_t      *const pDescInfo)
{
  /* LPBAM Data GPIO Descriptor Items Table */
  static const LPBAM_ItemDesc_t gpio_descitem_tbl[] =
  {
    /* LPBAM GPIO read pin data transfer node ID  */
    {LPBAM_GPIO_READPIN_OFFSET,  0U},
    /* LPBAM GPIO write pin data transfer node ID */
    {LPBAM_GPIO_WRITEPIN_OFFSET, 0U},
  };

  uint32_t dummy;

  /* Check node ID */
  switch (pConfNode->NodeDesc.NodeInfo.NodeID)
  {
    /* LPBAM GPIO read pin node ID */
    case LPBAM_GPIO_READPIN_ID:
    {
      /* Set DMA source address */
      pDescInfo->SrcAddr  = gpio_descitem_tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegOffset +
                            (uint32_t)pConfNode->pInstance;
      /* Set DMA destination address */
      pDescInfo->DstAddr  = (uint32_t)pConfNode->NodeDesc.pBuff;
      /* Set DMA data size */
      pDescInfo->DataSize = (uint16_t)(pConfNode->Config.Size * 2U);

      break;
    }

    /* LPBAM GPIO write pin node ID */
    case LPBAM_GPIO_WRITEPIN_ID:
    {
      /* Check write pin mode */
      if (pConfNode->Config.IsSequenceMode == LPBAM_GPIO_IS_SINGLE_MODE)
      {
        /* Check pin state */
        if (pConfNode->Config.PinState == (uint16_t)LPBAM_GPIO_PIN_SET)
        {
          dummy = pConfNode->Config.Pin;
        }
        else
        {
          dummy = (uint32_t)pConfNode->Config.Pin << 16U;
        }

        /* Set value to be written */
        *pConfNode->NodeDesc.pSrcVarReg = dummy;

        /* Set DMA source address */
        pDescInfo->SrcAddr  = (uint32_t)pConfNode->NodeDesc.pSrcVarReg;
        /* Set DMA data size */
        pDescInfo->DataSize = 4U;
      }
      else
      {
        /* Set DMA source address */
        pDescInfo->SrcAddr  = (uint32_t)pConfNode->NodeDesc.pBuff;
        /* Set DMA data size */
        pDescInfo->DataSize = ((uint32_t)pConfNode->Config.Size) * 4U;
      }

      /* Set DMA destination address */
      pDescInfo->DstAddr  = gpio_descitem_tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegOffset +
                            (uint32_t)pConfNode->pInstance;
      break;
    }

    default:
    {
      /* return status */
      return LPBAM_INVALID_ID;
      break;
    }
  }

  return LPBAM_OK;
}
#endif /* LPBAM_GPIO_MODULE_ENABLED */


#if defined (LPBAM_I2C_MODULE_ENABLED)
/**
  * @brief  Fill the structure information for I2C peripheral nodes.
  * @param  pConfNode    : [IN]  Pointer to a LPBAM_I2C_ConfNode_t structure that contains node configuration.
  * @param  pDescInfo    : [OUT] Pointer to a LPBAM_InfoDesc_t structure that contains descriptor information.
  * @retval LPBAM Status : [OUT] Value from LPBAM_Status_t enumeration.
  */
LPBAM_Status_t LPBAM_I2C_FillStructInfo(LPBAM_I2C_ConfNode_t const *const pConfNode,
                                        LPBAM_InfoDesc_t     *const pDescInfo)
{
  /* LPBAM Configuration I2C Descriptor Items Table */
  static const LPBAM_ItemDesc_t i2c_descitem_tbl[] =
  {
    /* LPBAM I2C State node ID                  */
    {LPBAM_I2C_STATE_OFFSET,               LPBAM_I2C_STATE_DATASIZE             },
    /* LPBAM I2C configuration transfer node ID */
    {LPBAM_I2C_CONFIG_TRANSACTION_OFFSET,  LPBAM_I2C_CONFIG_TRANSACTION_DATASIZE},
    /* LPBAM I2C  timing node ID                */
    {LPBAM_I2C_TIMING_OFFSET,              LPBAM_I2C_TIMING_DATASIZE            },
    /* LPBAM I2C  trigger node ID               */
    {LPBAM_I2C_TRIG_OFFSET,                LPBAM_I2C_TRIG_DATASIZE              },
    /* LPBAM I2C transmit data node ID          */
    {LPBAM_I2C_TRANSMIT_DATA_OFFSET,       0U                                   },
    /* LPBAM I2C receive data node ID           */
    {LPBAM_I2C_RECEIVE_DATA_OFFSET,        0U                                   },
  };

  uint32_t dummy = 0U;

  /* Automatic end mode state */
  static LPBAM_FunctionalState xfer_cplt_it_state = DISABLE;

  /* Set DMA software request by default */
  pDescInfo->Request   = DMA_REQUEST_SW;
  pDescInfo->Direction = DMA_MEMORY_TO_MEMORY;

  /* Check node ID */
  switch (pConfNode->NodeDesc.NodeInfo.NodeID)
  {
    /* LPBAM I2C State node ID */
    case LPBAM_I2C_STATE_ID:
    {
      /* Get control register value */
      dummy = pConfNode->pInstance->CR1;

      /* Check I2C state */
      if (pConfNode->Config.State == ENABLE)
      {
        /* Enable I2C instance */
        dummy |= I2C_CR1_PE;

        /* Set wake up interrupts */
        dummy |= pConfNode->Config.WakeupIT;

        /* Check for stop interrupt */
        if ((pConfNode->Config.WakeupIT & LPBAM_I2C_IT_STOP) == LPBAM_I2C_IT_STOP)
        {
          /* Disable automatic clear of stop detection */
          dummy &= ~(I2C_CR1_STOPFACLR);
        }

        /* Check for address match interrupt */
        if ((pConfNode->Config.WakeupIT & LPBAM_I2C_IT_ADDRI) == LPBAM_I2C_IT_ADDRI)
        {
          /* Disable automatic clear of address match */
          dummy &= ~(I2C_CR1_ADDRACLR);
        }

        if ((pConfNode->Config.WakeupIT & LPBAM_I2C_IT_TC) == LPBAM_I2C_IT_TC)
        {
          /* Software end mode will be used as TC interrupt is enabled */
          xfer_cplt_it_state = ENABLE;
        }
        else
        {
          xfer_cplt_it_state = DISABLE;
        }
      }
      else
      {
        /* Disable I2C instance */
        dummy &= ~(I2C_CR1_PE);
      }

