STMicroelectronics/STM32CubeU5/Utilities/lpbam/STM32U5/stm32_ll_lpbam.c
    /* LPBAM I2C  trigger node ID */
    case LPBAM_I2C_TRIG_ID:
    {
      /* Check trigger state */
      if (pConfNode->Config.AutoModeConf.TriggerState == LPBAM_I2C_AUTO_MODE_DISABLE)
      {
        /* Set value to be written */
        dummy = pConfNode->pInstance->AUTOCR & ~(I2C_AUTOCR_TRIGEN);
      }
      else
      {
        /* Set value to be written */
        dummy = pConfNode->pInstance->AUTOCR | I2C_AUTOCR_TRIGEN |
                (pConfNode->Config.AutoModeConf.TriggerSelection << I2C_AUTOCR_TRIGSEL_Pos);

        /* Check trigger polarity */
        if (pConfNode->Config.AutoModeConf.TriggerPolarity == LPBAM_I2C_TRIG_POLARITY_FALLING)
        {
          /* Set trigger polarity */
          dummy |= I2C_AUTOCR_TRIGPOL;
        }
        else
        {
          /* Set trigger polarity */
          dummy &= ~I2C_AUTOCR_TRIGPOL;
        }
      }

      /* Set value to be written */
      *pConfNode->NodeDesc.pSrcVarReg = dummy;

      /* Set DMA source address */
      pDescInfo->SrcAddr  = (uint32_t)pConfNode->NodeDesc.pSrcVarReg;
      /* Set DMA destination address */
      pDescInfo->DstAddr  = i2c_descitem_tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegOffset +
                            (uint32_t)pConfNode->pInstance;
      /* Set DMA data size */
      pDescInfo->DataSize = i2c_descitem_tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegDataSize;

      break;
    }

    /* LPBAM I2C transmit data node ID */
    case LPBAM_I2C_TRANSMIT_DATA_ID:
    {
      /* Select request for transmit data node */
      pDescInfo->Request  = LPDMA1_REQUEST_I2C3_TX;

      /* Set DMA source address */
      pDescInfo->SrcAddr  = (uint32_t)pConfNode->NodeDesc.pBuff;
      /* Set DMA destination address */
      pDescInfo->DstAddr  = i2c_descitem_tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegOffset +
                            (uint32_t)pConfNode->pInstance;
      /* Set DMA data size */
      pDescInfo->DataSize = pConfNode->Config.Size;

      /* Overwrite data size for not last reload data transfer */
      if ((pConfNode->Config.ReloadDataState == ENABLE) &&
          (pConfNode->Config.IsLastReloadData != LPBAM_I2C_IS_LAST_RELOADED_DATA))
      {
        /* Overwrite data size */
        pDescInfo->DataSize = LPBAM_I2C_MAX_DATA_SIZE;
      }

      break;
    }

    /* LPBAM I2C receive data node ID */
    case LPBAM_I2C_RECEIVE_DATA_ID:
    {
      /* Select request for receive data node */
      pDescInfo->Request  = LPDMA1_REQUEST_I2C3_RX;

      /* Set DMA source address */
      pDescInfo->SrcAddr  = i2c_descitem_tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegOffset +
                            (uint32_t)pConfNode->pInstance;
      /* Set DMA destination address */
      pDescInfo->DstAddr  = (uint32_t)pConfNode->NodeDesc.pBuff;
      /* Set DMA data size */
      pDescInfo->DataSize = pConfNode->Config.Size;

      /* Overwrite data size for not last reload data transfer */
      if ((pConfNode->Config.ReloadDataState == ENABLE) &&
          (pConfNode->Config.IsLastReloadData != LPBAM_I2C_IS_LAST_RELOADED_DATA))
      {
        /* Overwrite data size */
        pDescInfo->DataSize = LPBAM_I2C_MAX_DATA_SIZE;
      }

      break;
    }

    default:
    {
      /* return status */
      return LPBAM_INVALID_ID;
      break;
    }
  }

  return LPBAM_OK;
}
#endif /* defined (LPBAM_I2C_MODULE_ENABLED) */


#if defined (LPBAM_LPTIM_MODULE_ENABLED)
/**
  * @brief  Fill the structure information for LPTIM peripheral nodes.
  * @param  pConfNode    : [IN]  Pointer to a LPBAM_LPTIM_ConfNode_t structure that contains node configuration.
  * @param  pDescInfo    : [OUT] Pointer to a LPBAM_InfoDesc_t structure that contains descriptor information.
  * @retval LPBAM Status : [OUT] Value from LPBAM_Status_t enumeration.
  */
LPBAM_Status_t LPBAM_LPTIM_FillStructInfo(LPBAM_LPTIM_ConfNode_t const *const pConfNode,
                                          LPBAM_InfoDesc_t       *const pDescInfo)
{
  /* LPBAM Configuration LPTIM Descriptor Items Table */
  static const LPBAM_ItemDesc_t lptim_descitem_tbl[] =
  {
    /* LPBAM LPTIM Configuration node ID       */
    {LPBAM_LPTIM_CONFIG_OFFSET,            LPBAM_LPTIM_CONFIG_DATASIZE           },
    /* LPBAM LPTIM Update Period node ID      */
    {LPBAM_LPTIM_CONFIG_PERIOD_OFFSET,     LPBAM_LPTIM_CONFIG_PERIOD_DATASIZE    },
    /* LPBAM LPTIM Update Pulse node ID       */
    {LPBAM_LPTIM_CONFIG_PULSE_OFFSET,      LPBAM_LPTIM_CONFIG_PULSE_DATASIZE     },
    /* LPBAM LPTIM Update Repetition node ID  */
    {LPBAM_LPTIM_CONFIG_REPETITION_OFFSET, LPBAM_LPTIM_CONFIG_REPETITION_DATASIZE},
    /* LPBAM LPTIM Get Counter node ID       */
    {LPBAM_LPTIM_GET_COUNTER_OFFSET,       0U                                    },
    /* LPBAM LPTIM Input Capture node ID      */
    {LPBAM_LPTIM_INPUT_CAPTURE_OFFSET,     0U                                    },
    /* LPBAM LPTIM Wakeup Interrupt node ID   */
    {LPBAM_LPTIM_WAKEUP_IT_OFFSET,         LPBAM_LPTIM_WAKEUP_IT_DATASIZE        },
    /* LPBAM LPTIM Clear Flag node ID         */
    {LPBAM_LPTIM_CLEARFLAG_OFFSET,         LPBAM_LPTIM_CLEARFLAG_DATASIZE        }
  };

  uint32_t dummy;

  /* Check node ID */
  switch (pConfNode->NodeDesc.NodeInfo.NodeID)
  {
    /* LPBAM LPTIM Update Period node ID */
    case LPBAM_LPTIM_CONFIG_ID:
    {
      /* Get control register value */
      dummy = pConfNode->pInstance->CR;

      /* Check LPTIM state */
      if (pConfNode->Config.State == ENABLE)
      {
        /* Set LPTIM update event request */
        pDescInfo->Request = DMA_REQUEST_SW;

        /* Set LPTIM state */
        dummy |= LPTIM_CR_ENABLE;

        /* Check LPTIM start mode update */
        if (pConfNode->Config.UpdateStartMode == ENABLE)
        {
          if (pConfNode->Config.StartMode == LPBAM_LPTIM_START_SINGLE)
          {
            /* Configure LPTIM to start in single mode */
            dummy |= LPTIM_CR_SNGSTRT;
          }
          else
          {
            /* Configure LPTIM to start in continuous mode */
            dummy |= LPTIM_CR_CNTSTRT;
          }
        }
      }
      else
      {
        /* Set LPTIM state */
        dummy &= ~(LPTIM_CR_ENABLE);

        /* Check LPTIM mode */
        if (pConfNode->Config.Mode == LPBAM_LPTIM_UE_MODE)
        {
          /* Check LPTIM instance */
          if (pConfNode->pInstance == LPTIM1)
          {
            /* Set LPTIM1 update event request */
            pDescInfo->Request = LPDMA1_REQUEST_LPTIM1_UE;
          }
          else
          {
            /* Set LPTIM3 update event request */
            pDescInfo->Request = LPDMA1_REQUEST_LPTIM3_UE;
          }
        }
        else
        {
          /* Set LPTIM update event request */
          pDescInfo->Request = DMA_REQUEST_SW;
        }
      }

      /* Set value to be written */
      *pConfNode->NodeDesc.pSrcVarReg = dummy;

      /* Set DMA source address */
      pDescInfo->SrcAddr  = (uint32_t)pConfNode->NodeDesc.pSrcVarReg;
      /* Set DMA destination address */
      pDescInfo->DstAddr  = lptim_descitem_tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegOffset +
                            (uint32_t)pConfNode->pInstance;
      /* Set DMA data size */
      pDescInfo->DataSize = lptim_descitem_tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegDataSize;

      break;
    }

    /* LPBAM LPTIM Update Period node ID */
    case LPBAM_LPTIM_UPDATE_PERIOD_ID:
    {
      /* Check LPTIM instance */
      if (pConfNode->pInstance == LPTIM1)
      {
        /* Set update event DMA request */
        pDescInfo->Request  = LPDMA1_REQUEST_LPTIM1_UE;
      }
      else
      {
        /* Set update event DMA request */
        pDescInfo->Request  = LPDMA1_REQUEST_LPTIM3_UE;
      }

      /* Check LPTIM mode */
      if (pConfNode->Config.Mode == LPBAM_LPTIM_UE_MODE)
      {
        /* Set DMA SW request */
        pDescInfo->Request  = DMA_REQUEST_SW;
      }

