STMicroelectronics/STM32CubeU5/Utilities/lpbam/STM32U5/stm32_ll_lpbam.c
      /* Set node information */
      if (pConfNode->NodeDesc.pBuff == NULL)
      {
        /* Set DMA source address */
        pDescInfo->SrcAddr = (uint32_t)pConfNode->NodeDesc.pSrcVarReg;
      }
      else
      {
        /* Set DMA source address */
        pDescInfo->SrcAddr = (uint32_t)&pConfNode->NodeDesc.pBuff[0U];
      }
      /* Set DMA destination address */
      pDescInfo->DstAddr  = lptim_descitem_tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegOffset +
                            (uint32_t)pConfNode->pInstance;
      /* Set DMA data size */
      pDescInfo->DataSize = pConfNode->Config.Size * 2U;

      break;
    }

    /* LPBAM LPTIM Update Pulse node ID */
    case LPBAM_LPTIM_UPDATE_PULSE_ID:
    {
      /* Check LPTIM instance */
      if (pConfNode->pInstance == LPTIM1)
      {
        /* Set update event DMA request */
        pDescInfo->Request  = LPDMA1_REQUEST_LPTIM1_UE;
      }
      else
      {
        /* Set update event DMA request */
        pDescInfo->Request  = LPDMA1_REQUEST_LPTIM3_UE;
      }

      /* Set node information */
      if (pConfNode->NodeDesc.pBuff == NULL)
      {
        /* Set DMA source address */
        pDescInfo->SrcAddr = (uint32_t)pConfNode->NodeDesc.pSrcVarReg;
      }
      else
      {
        /* Set DMA source address */
        pDescInfo->SrcAddr = (uint32_t)&pConfNode->NodeDesc.pBuff[0U];
      }

      /* LPTIM channel 1 */
      if (pConfNode->Config.Channel == LPBAM_LPTIM_CHANNEL_1)
      {
        /* Set DMA destination address */
        pDescInfo->DstAddr = lptim_descitem_tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegOffset +
                             (uint32_t)pConfNode->pInstance;
      }
      /* LPTIM channel 2 */
      else
      {
        /* Set DMA destination address */
        pDescInfo->DstAddr = lptim_descitem_tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegOffset +
                             (uint32_t)pConfNode->pInstance + LPBAM_LPTIM_CHANNEL_OFFSET;
      }
      /* Set DMA data size */
      pDescInfo->DataSize = pConfNode->Config.Size * 2U;

      break;
    }

    /* LPBAM LPTIM Update Repetition node ID */
    case LPBAM_LPTIM_UPDATE_REPETITION_ID:
    {
      /* Check LPTIM instance */
      if (pConfNode->pInstance == LPTIM1)
      {
        /* Set update event DMA request */
        pDescInfo->Request = LPDMA1_REQUEST_LPTIM1_UE;
      }
      else
      {
        /* Set update event DMA request */
        pDescInfo->Request = LPDMA1_REQUEST_LPTIM3_UE;
      }

      /* Check LPTIM mode */
      if (pConfNode->Config.Mode == LPBAM_LPTIM_UE_MODE)
      {
        /* Set DMA SW request */
        pDescInfo->Request = DMA_REQUEST_SW;
      }

      /* Set node information */
      if (pConfNode->NodeDesc.pBuff == NULL)
      {
        /* Set DMA source address */
        pDescInfo->SrcAddr = (uint32_t)pConfNode->NodeDesc.pSrcVarReg;
      }
      else
      {
        /* Set DMA source address */
        pDescInfo->SrcAddr = (uint32_t)&pConfNode->NodeDesc.pBuff[0U];
      }

      /* Set DMA destination address */
      pDescInfo->DstAddr = lptim_descitem_tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegOffset +
                           (uint32_t)pConfNode->pInstance;
      /* Set DMA data size */
      pDescInfo->DataSize = lptim_descitem_tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegDataSize;

      break;
    }

    /* LPBAM LPTIM Get Counter node ID */
    case LPBAM_LPTIM_GET_COUNTER_ID:
    {
      /* Set DMA source address */
      pDescInfo->SrcAddr = lptim_descitem_tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegOffset +
                           (uint32_t)pConfNode->pInstance;
      /* Set DMA destination address */
      pDescInfo->DstAddr  = (uint32_t)&pConfNode->NodeDesc.pBuff[0U];
      /* Set DMA data size */
      pDescInfo->DataSize = pConfNode->Config.CaptureCount * 2U;

      break;
    }

    /* LPBAM LPTIM Input Capture node ID */
    case LPBAM_LPTIM_INPUT_CAPTURE_ID:
    {
      /* LPTIM channel 1 */
      if (pConfNode->Config.Channel == LPBAM_LPTIM_CHANNEL_1)
      {
        /* Set DMA source address */
        pDescInfo->SrcAddr = lptim_descitem_tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegOffset +
                             (uint32_t)pConfNode->pInstance;

        /* Check LPTIM instance */
        if (pConfNode->pInstance == LPTIM1)
        {
          /* Set input capture DMA request */
          pDescInfo->Request = LPDMA1_REQUEST_LPTIM1_IC1;
        }
        else
        {
          /* Set input capture DMA request */
          pDescInfo->Request = LPDMA1_REQUEST_LPTIM3_IC1;
        }
      }
      /* LPTIM channel 2 */
      else
      {
        /* Set DMA source address */
        pDescInfo->SrcAddr = lptim_descitem_tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegOffset +
                             (uint32_t)pConfNode->pInstance + LPBAM_LPTIM_CHANNEL_OFFSET;

        /* Check LPTIM instance */
        if (pConfNode->pInstance == LPTIM1)
        {
          /* Set input capture DMA request */
          pDescInfo->Request = LPDMA1_REQUEST_LPTIM1_IC2;
        }
        else
        {
          /* Set input capture DMA request */
          pDescInfo->Request = LPDMA1_REQUEST_LPTIM3_IC2;
        }
      }

      /* Set DMA destination address */
      pDescInfo->DstAddr  = (uint32_t)&pConfNode->NodeDesc.pBuff[0U];
      /* Set DMA data size */
      pDescInfo->DataSize = pConfNode->Config.CaptureCount * 2U;

      break;
    }

    /* LPBAM LPTIM Wakeup Interrupt node ID */
    case LPBAM_LPTIM_WAKEUP_IT_ID:
    {
      /* Get enable interrupt register value */
      dummy = pConfNode->pInstance->DIER;

      /* Set value to be written */
      dummy |= pConfNode->Config.WakeupIT;

      /* Set value to be written */
      *pConfNode->NodeDesc.pSrcVarReg = dummy;

      /* Set DMA source address */
      pDescInfo->SrcAddr  = (uint32_t)pConfNode->NodeDesc.pSrcVarReg;
      /* Set DMA destination address */
      pDescInfo->DstAddr  = lptim_descitem_tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegOffset +
                            (uint32_t)pConfNode->pInstance;
      /* Set DMA data size */
      pDescInfo->DataSize = lptim_descitem_tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegDataSize;

      break;
    }

    /* LPBAM LPTIM Clear Flag node ID */
    case LPBAM_LPTIM_CLEARFLAG_ID:
    {
      /* Set clear update event mask value */
      dummy = LPTIM_ISR_UE;

      /* Set value to be written */
      *pConfNode->NodeDesc.pSrcVarReg = dummy;

      /* Set DMA source address */
      pDescInfo->SrcAddr  = (uint32_t)pConfNode->NodeDesc.pSrcVarReg;
      /* Set DMA destination address */
      pDescInfo->DstAddr  = lptim_descitem_tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegOffset +
                            (uint32_t)pConfNode->pInstance;
      /* Set DMA data size */
      pDescInfo->DataSize = lptim_descitem_tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegDataSize;

      break;
    }

    default:
    {
      /* return status */
      return LPBAM_INVALID_ID;
      break;
    }
  }

