STMicroelectronics/STM32CubeU5/Utilities/lpbam/STM32U5/stm32_ll_lpbam.c
  return LPBAM_OK;
}
#endif /* LPBAM_LPTIM_MODULE_ENABLED */


#if defined (LPBAM_OPAMP_MODULE_ENABLED)
/**
  * @brief  Fill the structure information for OPAMP peripheral nodes.
  * @param  pConfNode    : [IN]  Pointer to a LPBAM_OPAMP_ConfNode_t structure that contains node configuration.
  * @param  pDescInfo    : [OUT] Pointer to a LPBAM_InfoDesc_t structure that contains descriptor information.
  * @retval LPBAM Status : [OUT] Value from LPBAM_Status_t enumeration.
  */
LPBAM_Status_t LPBAM_OPAMP_FillStructInfo(LPBAM_OPAMP_ConfNode_t const *const pConfNode,
                                          LPBAM_InfoDesc_t       *const pDescInfo)
{
  /* LPBAM Configuration OPAMP Descriptor Items Table */
  static const LPBAM_ItemDesc_t LPBAM_OPAMP_DescItem_Tbl[] =
  {
    /* LPBAM OPAMP configuration node ID */
    {LPBAM_OPAMP_CONFIG_OFFSET, LPBAM_OPAMP_CONFIG_DATASIZE}
  };

  uint32_t dummy;

  /* Check node ID */
  switch (pConfNode->NodeDesc.NodeInfo.NodeID)
  {
    /* LPBAM OPAMP configuration node ID */
    case  LPBAM_OPAMP_CONFIG_ID:
    {
      /* Get register value */
      dummy = (((uint32_t)pConfNode->Instance->CSR & ~(LPBAM_OPAMP_CONFIG_MASK)) | ((uint32_t)pConfNode->Config.State) |
               pConfNode->Config.Mode | pConfNode->Config.NonInvertingInput | pConfNode->Config.InvertingInput         |
               pConfNode->Config.PgaGain);

      /* Set value to be written */
      *pConfNode->NodeDesc.pSrcVarReg = dummy;

      /* Set DMA source address */
      pDescInfo->SrcAddr  = (uint32_t)pConfNode->NodeDesc.pSrcVarReg;
      /* Set DMA destination address */
      pDescInfo->DstAddr  = LPBAM_OPAMP_DescItem_Tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegOffset +
                            (uint32_t)pConfNode->Instance;
      /* Set DMA data size */
      pDescInfo->DataSize = LPBAM_OPAMP_DescItem_Tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegDataSize;

      break;
    }

    default:
    {
      /* return status */
      return LPBAM_INVALID_ID;
      break;
    }
  }

  return LPBAM_OK;
}
#endif /* LPBAM_OPAMP_MODULE_ENABLED */


#if defined (LPBAM_SPI_MODULE_ENABLED)
/**
  * @brief  Fill the structure information for SPI peripheral nodes.
  * @param  pConfNode    : [IN]  Pointer to a LPBAM_SPI_ConfNode_t structure that contains node configuration.
  * @param  pDescInfo    : [OUT] Pointer to a LPBAM_InfoDesc_t structure that contains descriptor information.
  * @retval LPBAM Status : [OUT] Value from LPBAM_Status_t enumeration.
  */
LPBAM_Status_t LPBAM_SPI_FillStructInfo(LPBAM_SPI_ConfNode_t const *const pConfNode,
                                        LPBAM_InfoDesc_t     *const pDescInfo)
{
  /* LPBAM Configuration SPI Descriptor Items Table */
  static const LPBAM_ItemDesc_t LPBAM_SPI_DescItem_Tbl[] =
  {
    /* LPBAM SPI State node ID                       */
    {LPBAM_SPI_STATE_OFFSET,         LPBAM_SPI_STATE_DATASIZE       },
    /* LPBAM SPI Data Size node ID                   */
    {LPBAM_SPI_DATASIZE_OFFSET,      LPBAM_SPI_DATASIZE_DATASIZE    },
    /* LPBAM SPI Configuration Frame node ID         */
    {LPBAM_SPI_CONFIG_FRAME_OFFSET,  LPBAM_SPI_CONFIG_FRAME_DATASIZE},
    /* LPBAM SPI Configuration Communication node ID */
    {LPBAM_SPI_CONFIG_COM_OFFSET,    LPBAM_SPI_CONFIG_COM_DATASIZE  },
    /* LPBAM SPI Trigger node ID                     */
    {LPBAM_SPI_TRIG_OFFSET,          LPBAM_SPI_TRIG_DATASIZE        },
    /* LPBAM SPI Wakeup Interrupt ID                 */
    {LPBAM_SPI_WAKEUP_IT_OFFSET,     LPBAM_SPI_WAKEUP_IT_DATASIZE   },
    /* LPBAM SPI Start node ID                       */
    {LPBAM_SPI_START_OFFSET,         LPBAM_SPI_START_DATASIZE       },
    /* LPBAM SPI Transmit Data Transfer node ID      */
    {LPBAM_SPI_TRANSMIT_DATA_OFFSET, 0U                             },
    /* LPBAM SPI Receive Data Transfer node ID       */
    {LPBAM_SPI_RECEIVE_DATA_OFFSET,  0U                             },
    /* LPBAM SPI Clear Flag node ID                  */
    {LPBAM_SPI_CLEARFLAG_OFFSET,     LPBAM_SPI_CLEARFLAG_DATASIZE   }
  };

  uint32_t dummy = 0U;

  /* Check node ID */
  switch (pConfNode->NodeDesc.NodeInfo.NodeID)
  {
    /* LPBAM SPI State node ID */
    case LPBAM_SPI_STATE_ID:
    {
      /* Get register value */
      dummy = pConfNode->pInstance->CR1;

      /* Check SPI state */
      if (pConfNode->Config.State == DISABLE)
      {
        /* Set value to be written */
        dummy &= (~SPI_CR1_SPE);
      }
      /* Check SPI trigger state */
      else
      {
        /* Set value to be written */
        dummy |= SPI_CR1_SPE;
      }

      /* Set value to be written */
      *pConfNode->NodeDesc.pSrcVarReg = dummy;

      /* Set DMA source address */
      pDescInfo->SrcAddr  = (uint32_t)pConfNode->NodeDesc.pSrcVarReg;
      /* Set DMA destination address */
      pDescInfo->DstAddr  = LPBAM_SPI_DescItem_Tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegOffset +
                            (uint32_t)pConfNode->pInstance;
      /* Set DMA data size */
      pDescInfo->DataSize = LPBAM_SPI_DescItem_Tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegDataSize;

      break;
    }

    /* LPBAM SPI Data Size node ID */
    case LPBAM_SPI_DATASIZE_ID:
    {
      /* Get SPI size */
      dummy = pConfNode->Config.Size;

      /* Set value to be written */
      *pConfNode->NodeDesc.pSrcVarReg = dummy;

      /* Set DMA source address */
      pDescInfo->SrcAddr  = (uint32_t)pConfNode->NodeDesc.pSrcVarReg;
      /* Set DMA destination address */
      pDescInfo->DstAddr  = LPBAM_SPI_DescItem_Tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegOffset +
                            (uint32_t)pConfNode->pInstance;
      /* Set DMA data size */
      pDescInfo->DataSize = LPBAM_SPI_DescItem_Tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegDataSize;

      break;
    }

    /* LPBAM SPI Configuration Frame node ID */
    case LPBAM_SPI_CONFIG_FRAME_ID:
    {
      /* Get register value */
      dummy = pConfNode->pInstance->CFG1 & (~(SPI_CFG1_BPASS | SPI_CFG1_MBR | SPI_CFG1_DSIZE | SPI_CFG1_TXDMAEN |
                                              SPI_CFG1_RXDMAEN));

      /* Set data width and baudrate prescaler */
      dummy |= pConfNode->Config.DataSize | ((uint32_t)pConfNode->Config.BaudRatePrescaler << SPI_CFG1_MBR_Pos);

      /* Check SPI direction */
      if (pConfNode->Config.Direction == LPBAM_SPI_DIRECTION_2LINES)
      {
        /* Full duplex */
        dummy |= SPI_CFG1_TXDMAEN | SPI_CFG1_RXDMAEN;
      }
      else if (pConfNode->Config.Direction == LPBAM_SPI_DIRECTION_2LINES_TXONLY)
      {
        /* Simplex transmit */
        dummy |= SPI_CFG1_TXDMAEN;
      }
      else
      {
        /* Simplex receive */
        dummy |= SPI_CFG1_RXDMAEN;
      }

      /* Set value to be written */
      *pConfNode->NodeDesc.pSrcVarReg = dummy;

      /* Set DMA source address */
      pDescInfo->SrcAddr  = (uint32_t)pConfNode->NodeDesc.pSrcVarReg;
      /* Set DMA destination address */
      pDescInfo->DstAddr  = LPBAM_SPI_DescItem_Tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegOffset +
                            (uint32_t)pConfNode->pInstance;
      /* Set DMA data size */
      pDescInfo->DataSize = LPBAM_SPI_DescItem_Tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegDataSize;

      break;
    }

