STMicroelectronics/STM32CubeU5/Utilities/lpbam/STM32U5/stm32_ll_lpbam.c
    /* LPBAM SPI Configuration Communication node ID */
    case LPBAM_SPI_CONFIG_COM_ID:
    {
      /* Get register value */
      dummy = pConfNode->pInstance->CFG2 & (~(SPI_CFG2_COMM | SPI_CFG2_LSBFRST | SPI_CFG2_LSBFRST | SPI_CFG2_CPHA |
                                              SPI_CFG2_CPOL));

      /* Set clock polarity, clock phase, first bit and direction */
      dummy |= (((uint32_t)pConfNode->Config.CLKPolarity << SPI_CFG2_CPOL_Pos)    |
                ((uint32_t)pConfNode->Config.CLKPhase    << SPI_CFG2_CPHA_Pos)    |
                ((uint32_t)pConfNode->Config.FirstBit    << SPI_CFG2_LSBFRST_Pos) |
                ((uint32_t)pConfNode->Config.Direction   << SPI_CFG2_COMM_Pos));

      /* Set value to be written */
      *pConfNode->NodeDesc.pSrcVarReg = dummy;

      /* Set DMA source address */
      pDescInfo->SrcAddr  = (uint32_t)pConfNode->NodeDesc.pSrcVarReg;
      /* Set DMA destination address */
      pDescInfo->DstAddr  = LPBAM_SPI_DescItem_Tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegOffset +
                            (uint32_t)pConfNode->pInstance;
      /* Set DMA data size */
      pDescInfo->DataSize = LPBAM_SPI_DescItem_Tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegDataSize;

      break;
    }

    /* LPBAM SPI Trigger node ID */
    case LPBAM_SPI_TRIG_ID:
    {
      /* Check SPI trigger state */
      if (pConfNode->Config.AutoModeConf.TriggerState == LPBAM_SPI_AUTO_MODE_ENABLE)
      {
        /* Get register value */
        dummy = pConfNode->pInstance->AUTOCR & (~(SPI_AUTOCR_TRIGEN | SPI_AUTOCR_TRIGPOL | SPI_AUTOCR_TRIGSEL));

        /* Set trigger information */
        dummy |= ((pConfNode->Config.AutoModeConf.TriggerSelection << SPI_AUTOCR_TRIGSEL_Pos)          |
                  ((uint32_t)pConfNode->Config.AutoModeConf.TriggerPolarity << SPI_AUTOCR_TRIGPOL_Pos) |
                  SPI_AUTOCR_TRIGEN);
      }

      /* Set value to be written */
      *pConfNode->NodeDesc.pSrcVarReg = dummy;

      /* Set DMA source address */
      pDescInfo->SrcAddr  = (uint32_t)pConfNode->NodeDesc.pSrcVarReg;
      /* Set DMA destination address */
      pDescInfo->DstAddr  = LPBAM_SPI_DescItem_Tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegOffset +
                            (uint32_t)pConfNode->pInstance;
      /* Set DMA data size */
      pDescInfo->DataSize = LPBAM_SPI_DescItem_Tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegDataSize;

      break;
    }

    /* LPBAM SPI Wakeup Interrupt ID */
    case LPBAM_SPI_WAKEUP_IT_ID:
    {
      /* Set wake up value */
      dummy = pConfNode->pInstance->IER | pConfNode->Config.WakeupIT;

      /* Set value to be written */
      *pConfNode->NodeDesc.pSrcVarReg = dummy;

      /* Set DMA source address */
      pDescInfo->SrcAddr  = (uint32_t)pConfNode->NodeDesc.pSrcVarReg;
      /* Set DMA destination address */
      pDescInfo->DstAddr  = LPBAM_SPI_DescItem_Tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegOffset +
                            (uint32_t)pConfNode->pInstance;
      /* Set DMA data size */
      pDescInfo->DataSize = LPBAM_SPI_DescItem_Tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegDataSize;

      break;
    }

    /* LPBAM SPI Start node ID */
    case LPBAM_SPI_START_ID:
    {
      /* Calculate SPI start value */
      dummy = pConfNode->pInstance->CR1 | SPI_CR1_CSTART | SPI_CR1_SPE;

      /* Set value to be written */
      *pConfNode->NodeDesc.pSrcVarReg = dummy;

      /* Set DMA source address */
      pDescInfo->SrcAddr  = (uint32_t)pConfNode->NodeDesc.pSrcVarReg;
      /* Set DMA destination address */
      pDescInfo->DstAddr  = LPBAM_SPI_DescItem_Tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegOffset +
                            (uint32_t)pConfNode->pInstance;
      /* Set DMA data size */
      pDescInfo->DataSize = LPBAM_SPI_DescItem_Tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegDataSize;

      break;
    }

    /* LPBAM SPI Transmit Data Transfer node ID */
    case LPBAM_SPI_TRANSMIT_DATA_ID:
    {
      /* Select request for transmit data node */
      pDescInfo->Request  = LPDMA1_REQUEST_SPI3_TX;

      /* Set DMA source address */
      pDescInfo->SrcAddr  = (uint32_t)pConfNode->NodeDesc.pBuff;
      /* Set DMA destination address */
      pDescInfo->DstAddr  = LPBAM_SPI_DescItem_Tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegOffset +
                            (uint32_t)pConfNode->pInstance;

      /* Check SPI data width */
      if (pConfNode->Config.DataSize == LPBAM_SPI_DATASIZE_16BIT)
      {
        /* Set DMA data size */
        pDescInfo->DataSize = (uint32_t)pConfNode->Config.Size * 2U;
      }
      else
      {
        /* Set DMA data size */
        pDescInfo->DataSize = (uint32_t)pConfNode->Config.Size;
      }

      break;
    }

    /* LPBAM SPI Receive Data Transfer node ID */
    case LPBAM_SPI_RECEIVE_DATA_ID:
    {
      /* Select request for receive data node */
      pDescInfo->Request  = LPDMA1_REQUEST_SPI3_RX;

      /* Set DMA source address */
      pDescInfo->SrcAddr  = LPBAM_SPI_DescItem_Tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegOffset +
                            (uint32_t)pConfNode->pInstance;
      /* Set DMA destination address */
      pDescInfo->DstAddr  = (uint32_t)pConfNode->NodeDesc.pBuff;

      /* Check SPI data width */
      if (pConfNode->Config.DataSize == LPBAM_SPI_DATASIZE_16BIT)
      {
        /* Set DMA data size */
        pDescInfo->DataSize = (uint32_t)pConfNode->Config.Size * 2U;
      }
      else
      {
        /* Set DMA data size */
        pDescInfo->DataSize = (uint32_t)pConfNode->Config.Size;
      }

      break;
    }

    /* LPBAM SPI Clear Flag node ID */
    case LPBAM_SPI_CLEARFLAG_ID:
    {
      /* Get SPI clear flag mask */
      dummy = LPBAM_SPI_CLEARFLAG_MASK;

      /* Set value to be written */
      *pConfNode->NodeDesc.pSrcVarReg = dummy;

      /* Set DMA source address */
      pDescInfo->SrcAddr  = (uint32_t)pConfNode->NodeDesc.pSrcVarReg;
      /* Set DMA destination address */
      pDescInfo->DstAddr  = LPBAM_SPI_DescItem_Tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegOffset +
                            (uint32_t)pConfNode->pInstance;
      /* Set DMA data size */
      pDescInfo->DataSize = LPBAM_SPI_DescItem_Tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegDataSize;

      break;
    }

    default:
    {
      /* return status */
      return LPBAM_INVALID_ID;
      break;
    }
  }

