STMicroelectronics/STM32CubeU5/Utilities/lpbam/STM32U5/stm32_ll_lpbam.c
  return LPBAM_OK;
}
#endif /* LPBAM_SPI_MODULE_ENABLED */


#if defined (LPBAM_UART_MODULE_ENABLED)
/**
  * @brief  Fill the structure information for UART peripheral nodes.
  * @param  pConfNode    : [IN]  Pointer to a LPBAM_UART_ConfNode_t structure that contains node configuration.
  * @param  pDescInfo    : [OUT] Pointer to a LPBAM_InfoDesc_t structure that contains descriptor information.
  * @retval LPBAM Status : [OUT] Value from LPBAM_Status_t enumeration.
  */
LPBAM_Status_t LPBAM_UART_FillStructInfo(LPBAM_UART_ConfNode_t const *const pConfNode,
                                         LPBAM_InfoDesc_t      *const pDescInfo)
{
  /* LPBAM Configuration UART Descriptor Items Table */
  static const LPBAM_ItemDesc_t LPBAM_UART_DescItem_Tbl[] =
  {
    /* LPBAM UART Configuration State node ID            */
    {LPBAM_UART_CONFIG_OFFSET,         LPBAM_UART_CONFIG_DATASIZE        },
    /* LPBAM UART Configuration Autonomous mode node ID  */
    {LPBAM_UART_AUTONOMOUSMODE_OFFSET, LPBAM_UART_AUTONOMOUSMODE_DATASIZE},
    /* LPBAM UART Receive Data Transfer node ID          */
    {LPBAM_UART_RECEIVE_OFFSET,        0U                                },
    /* LPBAM UART Transmit Data Transfer node ID         */
    {LPBAM_UART_TRANSMIT_OFFSET,       0U                                },
    /* LPBAM UART Clear Flag node ID                     */
    {LPBAM_UART_CLEARFLAG_OFFSET,      LPBAM_UART_CLEARFLAG_DATASIZE     }
  };

  uint32_t dummy;

  /* Check node ID */
  switch (pConfNode->NodeDesc.NodeInfo.NodeID)
  {
    /* LPBAM UART configuration state node ID */
    case LPBAM_UART_CONFIG_ID:
    {
      /* Get register value */
      dummy = pConfNode->pInstance->CR1 & (~(USART_CR1_UE | USART_CR1_IDLEIE | USART_CR1_RXNEIE | USART_CR1_TCIE |
                                             USART_CR1_TXEIE | USART_CR1_TXFEIE | USART_CR1_RXFFIE));

      /* Calculate the configuration mask */
      if (pConfNode->Config.State == ENABLE)
      {
        /* Check UART direction */
        if (pConfNode->Config.Mode == LPBAM_UART_MODE_TX_RX)
        {
          /* Full duplex wake up interrupt mask */
          dummy |= (((pConfNode->Config.WakeupIT                                                                &
                      (LPBAM_UART_IT_TXFE | LPBAM_UART_IT_RXFF)) << LPBAM_UART_FIFO_IT_POS)                     |
                    ((pConfNode->Config.WakeupIT & (LPBAM_UART_IT_IDLE | LPBAM_UART_IT_TC | LPBAM_UART_IT_TXFNF |
                                                    LPBAM_UART_IT_RXFNE)) << USART_CR1_IDLEIE_Pos) | USART_CR1_UE);
        }
        else if (pConfNode->Config.Mode == LPBAM_UART_MODE_TX)
        {
          /* Simplex Tx wake up interrupt mask */
          dummy |= (((pConfNode->Config.WakeupIT & LPBAM_UART_IT_TXFE) << LPBAM_UART_FIFO_IT_POS)                     |
                    ((pConfNode->Config.WakeupIT & (LPBAM_UART_IT_TC | LPBAM_UART_IT_TXFNF)) << USART_CR1_IDLEIE_Pos) |
                    USART_CR1_UE);
        }
        else
        {
          /* Simplex Rx wake up interrupt mask */
          dummy |= (((pConfNode->Config.WakeupIT & LPBAM_UART_IT_RXFF) << LPBAM_UART_FIFO_IT_POS) |
                    ((pConfNode->Config.WakeupIT &
                      (LPBAM_UART_IT_IDLE | LPBAM_UART_IT_RXFNE)) << USART_CR1_IDLEIE_Pos) | USART_CR1_UE);
        }
      }

      /* Set value to be written */
      *pConfNode->NodeDesc.pSrcVarReg = dummy;

      /* Set DMA source address */
      pDescInfo->SrcAddr  = (uint32_t)pConfNode->NodeDesc.pSrcVarReg;
      /* Set DMA destination address */
      pDescInfo->DstAddr  = LPBAM_UART_DescItem_Tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegOffset +
                            (uint32_t)pConfNode->pInstance;
      /* Set DMA data size */
      pDescInfo->DataSize = LPBAM_UART_DescItem_Tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegDataSize;

      break;
    }

    /* LPBAM UART clear flag node ID */
    case LPBAM_UART_CLEARFLAG_ID:
    {
      /* Calculate the clear flag mask */
      dummy = USART_ICR_PECF | USART_ICR_FECF | USART_ICR_NECF | USART_ICR_ORECF | USART_ICR_IDLECF | USART_ICR_TCCF |
              USART_ICR_CTSCF | USART_ICR_CMCF;

      /* Set value to be written */
      *pConfNode->NodeDesc.pSrcVarReg = dummy;

      /* Set DMA source address */
      pDescInfo->SrcAddr  = (uint32_t)pConfNode->NodeDesc.pSrcVarReg;
      /* Set DMA destination address */
      pDescInfo->DstAddr  = LPBAM_UART_DescItem_Tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegOffset +
                            (uint32_t)pConfNode->pInstance;
      /* Set DMA data size */
      pDescInfo->DataSize = LPBAM_UART_DescItem_Tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegDataSize;

      break;
    }

    /* LPBAM UART configuration autonomous mode node ID */
    case LPBAM_UART_AUTONOMOUSMODE_ID:
    {
      /* Get register value */
      dummy = (pConfNode->pInstance->AUTOCR & (~(USART_AUTOCR_TDN | USART_AUTOCR_TRIGPOL |
                                                 USART_AUTOCR_TRIGEN | USART_AUTOCR_TRIGSEL)));

      /* Set autonomous mode info */
      dummy |= (((uint32_t)pConfNode->Config.AutoModeConf.AutonomousModeState << USART_AUTOCR_TRIGEN_Pos)  |
                ((uint32_t)pConfNode->Config.AutoModeConf.TriggerSelection    << USART_AUTOCR_TRIGSEL_Pos) |
                ((uint32_t)pConfNode->Config.AutoModeConf.TriggerPolarity     << USART_AUTOCR_TRIGPOL_Pos) |
                ((uint32_t)pConfNode->Config.AutoModeConf.DataSize            << USART_AUTOCR_TDN_Pos));

      /* Set value to be written */
      *pConfNode->NodeDesc.pSrcVarReg = dummy;

      /* Set DMA source address */
      pDescInfo->SrcAddr  = (uint32_t)pConfNode->NodeDesc.pSrcVarReg;
      /* Set DMA destination address */
      pDescInfo->DstAddr  = LPBAM_UART_DescItem_Tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegOffset +
                            (uint32_t)pConfNode->pInstance;
      /* Set DMA data size */
      pDescInfo->DataSize = LPBAM_UART_DescItem_Tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegDataSize;

      break;
    }

    /* LPBAM UART transmit data transfer node ID */
    case LPBAM_UART_TRANSMIT_DATA_ID:
    {
      /* Set node information */
      pDescInfo->Request  = LPDMA1_REQUEST_LPUART1_TX;
      /* Set DMA source address */
      pDescInfo->SrcAddr  = (uint32_t)pConfNode->NodeDesc.pBuff;
      /* Set DMA destination address */
      pDescInfo->DstAddr  = LPBAM_UART_DescItem_Tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegOffset +
                            (uint32_t)pConfNode->pInstance;
      /* Set DMA data size */
      pDescInfo->DataSize = (uint32_t)pConfNode->Config.Size;

      break;
    }

