STMicroelectronics/STM32CubeU5/Utilities/lpbam/STM32U5/stm32_ll_lpbam.c
    /* LPBAM UART receive data transfer node ID */
    case LPBAM_UART_RECEIVE_DATA_ID :
    {
      /* Set node information */
      pDescInfo->Request  = LPDMA1_REQUEST_LPUART1_RX;
      /* Set DMA source address */
      pDescInfo->SrcAddr  = LPBAM_UART_DescItem_Tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegOffset +
                            (uint32_t)pConfNode->pInstance;
      /* Set DMA destination address */
      pDescInfo->DstAddr  = (uint32_t)pConfNode->NodeDesc.pBuff;
      /* Set DMA data size */
      pDescInfo->DataSize = (uint32_t)pConfNode->Config.Size;

      break;
    }

    default:
    {
      /* return status */
      return LPBAM_INVALID_ID;
      break;
    }
  }

  return LPBAM_OK;
}
#endif /* LPBAM_UART_MODULE_ENABLED */


#if defined (LPBAM_VREFBUF_MODULE_ENABLED)
/**
  * @brief  Fill the structure information for VREFBUF peripheral nodes.
  * @param  pConfNode    : [IN]  Pointer to a LPBAM_VREFBUF_ConfNode_t structure that contains node configuration.
  * @param  pDescInfo    : [OUT] Pointer to a LPBAM_InfoDesc_t structure that contains descriptor information.
  * @retval LPBAM Status : [OUT] Value from LPBAM_Status_t enumeration.
  */
LPBAM_Status_t LPBAM_VREFBUF_FillStructInfo(LPBAM_VREFBUF_ConfNode_t const *const pConfNode,
                                            LPBAM_InfoDesc_t         *const pDescInfo)
{
  /* LPBAM Configuration VREFBUF Descriptor Items Table */
  static const LPBAM_ItemDesc_t LPBAM_VREFBUF_DescItem_Tbl[] =
  {
    /* LPBAM VREFBUF mode selection node ID  */
    {LPBAM_VREFBUF_MODE_OFFSET, LPBAM_VREFBUF_MODE_DATASIZE}
  };

  uint32_t dummy;

  /* Check node ID */
  switch (pConfNode->NodeDesc.NodeInfo.NodeID)
  {
    /* LPBAM VREFBUF mode selection node ID  */
    case LPBAM_VREFBUF_MODE_ID:
    {
      /* Get register value */
      dummy = (((uint32_t)pConfNode->pInstance->CSR & LPBAM_VREFBUF_CSR_MASK) | pConfNode->Config.BufferMode);

      /* Set value to be written */
      *pConfNode->NodeDesc.pSrcVarReg = dummy;

      /* Set DMA source address */
      pDescInfo->SrcAddr  = (uint32_t)pConfNode->NodeDesc.pSrcVarReg;
      /* Set DMA destination address */
      pDescInfo->DstAddr  = LPBAM_VREFBUF_DescItem_Tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegOffset +
                            (uint32_t)pConfNode->pInstance;
      /* Set DMA data size */
      pDescInfo->DataSize = LPBAM_VREFBUF_DescItem_Tbl[pConfNode->NodeDesc.NodeInfo.NodeID].RegDataSize;

      break;
    }

    default:
    {
      /* return status */
      return LPBAM_INVALID_ID;
      break;
    }
  }

  return LPBAM_OK;
}
#endif /* LPBAM_VREFBUF_MODULE_ENABLED */
/**
  * @}
  */

/**
  * @}
  */
